Revit 2027 API
ParameterUtils.IsBuiltInParameter(ForgeTypeId) Method
 Checks whether a ForgeTypeId identifies a built-in parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsBuiltInParameter(
	ForgeTypeId parameterTypeId
)
Public Shared Function IsBuiltInParameter (
	parameterTypeId As ForgeTypeId
) As Boolean
public:
static bool IsBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
static member IsBuiltInParameter :
        parameterTypeId : ForgeTypeId -> bool
Parameters
parameterTypeId ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies a built-in parameter, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A ForgeTypeId identifies a built-in parameter if it corresponds to a valid BuiltInParameter value.
See Also
Reference
ParameterUtils Class
IsBuiltInParameter Overload
Autodesk.Revit.DB Namespace